In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame() # blank dataframe

In [3]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [4]:
df1 = pd.DataFrame( ( [1,2,2,3,4,5,6,3],[12,12,12,1,4,3,4],[12,12,12,1,4,3,4],[1212,112,1212,11,44,311,12] ) )
df1

      0    1     2   3   4    5   6    7
0     1    2     2   3   4    5   6  3.0
1    12   12    12   1   4    3   4  NaN
2    12   12    12   1   4    3   4  NaN
3  1212  112  1212  11  44  311  12  NaN

### getting size of dataframe

In [5]:
df1.shape # rows and column

# it is important to see the size first so that we dont execute any loops which took a lot of time

(4, 8)

# head() to get beginning of any dataframe.
with argument it will print the provided number of rows.
without argument it will print some of the rows.

In [6]:
df1.head()

      0    1     2   3   4    5   6    7
0     1    2     2   3   4    5   6  3.0
1    12   12    12   1   4    3   4  NaN
2    12   12    12   1   4    3   4  NaN
3  1212  112  1212  11  44  311  12  NaN

In [7]:
df1.head(1)

   0  1  2  3  4  5  6    7
0  1  2  2  3  4  5  6  3.0

# tail() to get data from the end
argument is same as head

In [8]:
df1.tail(1) # to get the last row data

      0    1     2   3   4    5   6   7
3  1212  112  1212  11  44  311  12 NaN

<b style="color:green;">Never left dataframe in the notebook open. If large amount of data is present then it would take a lot of ram </b>

# Giving custom dataframe column name

In [9]:
df1 = pd.DataFrame( ( [1,2,2,3,4,5,6,3],[12,12,12,1,4,3,4],[12,12,12,1,4,3,4],[1212,112,1212,11,44,311,12] ),
                  columns=["a","b","c","d","e","f","g","h"])
df1

      a    b     c   d   e    f   g    h
0     1    2     2   3   4    5   6  3.0
1    12   12    12   1   4    3   4  NaN
2    12   12    12   1   4    3   4  NaN
3  1212  112  1212  11  44  311  12  NaN

# Slicing 
<hr>

<b style="color:green;">Use this instead of forloop</b>

In [10]:
df1

      a    b     c   d   e    f   g    h
0     1    2     2   3   4    5   6  3.0
1    12   12    12   1   4    3   4  NaN
2    12   12    12   1   4    3   4  NaN
3  1212  112  1212  11  44  311  12  NaN

In [11]:
df1.iloc[0] # row at 0th index

a    1.0
b    2.0
c    2.0
d    3.0
e    4.0
f    5.0
g    6.0
h    3.0
Name: 0, dtype: float64

In [12]:
df1.iloc[0,0] # row 0 and column 0 cell or data

1

In [13]:
# getting 2 rows and 3 columns
df1.iloc[0:2 , 0:3]

    a   b   c
0   1   2   2
1  12  12  12